<?php

/**
 * 字符串连接，一个 点
 */
$str1 = 'Hello';
$str2 = 'World';
echo $str1 . $str2;
echo "<br>";
echo $str1.$str2;

/**
 * 算术运算符：
 *      加： +
 *      减： -
 *      乘： *
 *      除： /
 *      取余： %
 */


/**
 * 赋值运算符：
 *      基础赋值：=
 *      复合赋值：+=、-=、*= 。。。。。
 */


/**
 * 比较运算符：
 *      相等关系：
 *          等于 ==
 *          不等于 !=
 *          全等 ===
 *          不全等 !==
 *      大小关系：
 *          > < >= <=
 *      是否关系：
 */


/**
 * 逻辑运算符：
 *      与 &&
 *      或 ||
 *      非 !
 */

/**
 * 三元运算符 M ? A : B
 */


/**
 * 前置自增 ++x
 * 前置自减 --x
 * 后置自增 x++
 * 后置自减 x--
 */


